snlkuharlocal/src/Documents/ЗаявкаНаУстановкуЦен/ЗаявкаНаУстановкуЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаУстановкуЦен</name>
  <basedOn>Document.ПрайсЛист</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействителенПо</name>
    <comment>Дата окончания действия скидок</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаУстановкуЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбмена</name>
    <comment>Статус обмена</comment>
    <type>
      <types>EnumRef.СтатусыОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаявки</name>
    <type>
      <types>EnumRef.ВидыЗаявокНаУстановкуЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ПрайсЛист</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЦеныНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Прайс</name>
    <type>
      <types>DocumentRef.ПрайсЛист</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтатусыЗаявокНаУстановкуЦен/СтатусыЗаявокНаУстановкуЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокНаУстановкуЦен</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаявкаНаУстановкуЦен/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СоздатьНаОсновании(Команда)
	
	СсылкаНаОбъект = Элементы.Список.ТекущиеДанные.Ссылка;
	
	Если ЗначениеНеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Статус = ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "Статус");
	
	Если Статус <> Перечисления.СтатусыЗаявокНаУстановкуЦен.Утверждена Тогда
		Сообщить("Заявка не в статусе <Утверждена>");
		Возврат;
	КонецЕсли;
	
	СписокДокументов = ЗаполнениеДокументов.СуществуютТипыДокументовВводимыеНаОсновании(СсылкаНаОбъект);
	
	ВыбЭлемент = СписокДокументов.ВыбратьЭлемент("Выберите основание");
	
	Если ВыбЭлемент <> Неопределено Тогда
		
		Длина = СтрДлина(ВыбЭлемент.Значение);
		Позиция = Найти(ВыбЭлемент.Значение, ".");
		Имя = Прав(ВыбЭлемент.Значение, Длина - Позиция);
		
		ПолноеИмяФормы = "Документ." + Имя + ".Форма.ФормаДокумента";
		
		ДокОбъект = Документы[Имя].СоздатьДокумент();
		//крохин начало 27.12.2022
		//ДокОбъект.Дата = ТекущаяДата();
		ДокОбъект.Дата = НачалоДня(ТекущаяДата());
		//крохин конец 27.12.2022
		Если ЕстьРеквизитДокумента("Дата2", ДокОбъект.Метаданные()) Тогда
			ДокОбъект.Дата2 = КонецГода((ТекущаяДата()+31536000));	
		КонецЕсли;
		ДокОбъект.Заполнить(СсылкаНаОбъект);
		
		// Кухарь А.Ю.  31.03.2023 начало
		// ДокОбъект.дата=НачалоДня(ДокОбъект.дата);
		ДокОбъект.дата=НачалоДня(ДокОбъект.дата);	
		ДокОбъект.Дата2=СсылкаНаОбъект.ДействителенПо;
		// Кухарь А.Ю.  31.03.2023 конец

		
		ДокОбъект.Записать();
		
		НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Прайс.Установить(ДокОбъект.Ссылка);
		НаборЗаписей.Прочитать();
		
		ТабличнаяЧасть = СсылкаНаОбъект.ЦеныНоменклатуры.Выгрузить();
		
		Для Каждого Стр ИЗ ТабличнаяЧасть Цикл
			
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Стр);
			
			НоваяЗапись.Период = ДокОбъект.Дата;
			НоваяЗапись.Прайс = ДокОбъект.Ссылка;
			НоваяЗапись.ТипЦен = СсылкаНаОбъект.ТипЦен;
			
			Уровень = НоваяЗапись.Номенклатура.Уровень();
			
			Если Уровень = 0 Тогда
				НоваяЗапись.ТипТовара = НоваяЗапись.Номенклатура;
				НоваяЗапись.Брэнд = Справочники.Номенклатура.ПустаяСсылка();
				НоваяЗапись.Модель = Справочники.Номенклатура.ПустаяСсылка();
			ИначеЕсли Уровень = 1 Тогда
				НоваяЗапись.ТипТовара = НоваяЗапись.Номенклатура.Родитель;                                             
				НоваяЗапись.Брэнд = НоваяЗапись.Номенклатура;
				НоваяЗапись.Модель = Справочники.Номенклатура.ПустаяСсылка();
			ИначеЕсли Уровень = 2 Тогда
				НоваяЗапись.ТипТовара = НоваяЗапись.Номенклатура.Родитель.Родитель;
				НоваяЗапись.Брэнд  = НоваяЗапись.Номенклатура.Родитель;
				НоваяЗапись.Модель = НоваяЗапись.Номенклатура;
			ИначеЕсли Уровень = 3 Тогда
				НоваяЗапись.ТипТовара = НоваяЗапись.Номенклатура.Родитель.Родитель.Родитель;
				НоваяЗапись.Брэнд = НоваяЗапись.Номенклатура.Родитель.Родитель;
				НоваяЗапись.Модель = НоваяЗапись.Номенклатура.Родитель;                      
			КонецЕсли;
			
			НоваяЗапись.УровеньДоступа = Уровень;
			
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
		
		ФормаДокумента = ДокОбъект.ПолучитьФорму();
		ФормаДокумента.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры
